benchmarks/result3.log
8         Threads
400       Connections per thread
60        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         2264.00          ---          ---       130.65171        96.76700       456.70300       626.68700       174.04 
Gets        22380.19         0.00     22380.19       129.70684        95.74300       458.75100       618.49500       872.31 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      24644.19         0.00     22380.19       129.79364        96.25500       458.75100       618.49500      1046.35 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       5.567        0.000
SET      59.647        5.000
SET      74.239       10.000
SET      78.335       15.000
SET      81.919       20.000
SET      83.967       25.000
SET      86.015       30.000
SET      89.087       35.000
SET      91.647       40.000
SET      94.207       45.000
SET      96.767       50.000
SET      98.303       52.500
SET      99.839       55.000
SET     101.887       57.500
SET     103.935       60.000
SET     107.007       62.500
SET     110.591       65.000
SET     114.687       67.500
SET     120.831       70.000
SET     127.999       72.500
SET     137.215       75.000
SET     142.335       76.250
SET     148.479       77.500
SET     156.671       78.750
SET     163.839       80.000
SET     171.007       81.250
SET     182.271       82.500
SET     193.535       83.750
SET     204.799       85.000
SET     218.111       86.250
SET     232.447       87.500
SET     238.591       88.125
SET     245.759       88.750
SET     252.927       89.375
SET     260.095       90.000
SET     268.287       90.625
SET     274.431       91.250
SET     282.623       91.875
SET     290.815       92.500
SET     301.055       93.125
SET     311.295       93.750
SET     315.391       94.062
SET     321.535       94.375
SET     327.679       94.688
SET     333.823       95.000
SET     339.967       95.312
SET     346.111       95.625
SET     352.255       95.938
SET     360.447       96.250
SET     366.591       96.562
SET     374.783       96.875
SET     378.879       97.031
SET     380.927       97.188
SET     385.023       97.344
SET     391.167       97.500
SET     395.263       97.656
SET     401.407       97.812
SET     405.503       97.969
SET     411.647       98.125
SET     417.791       98.281
SET     425.983       98.438
SET     430.079       98.516
SET     434.175       98.594
SET     438.271       98.672
SET     442.367       98.750
SET     446.463       98.828
SET     450.559       98.906
SET     456.703       98.984
SET     462.847       99.062
SET     471.039       99.141
SET     477.183       99.219
SET     479.231       99.258
SET     483.327       99.297
SET     487.423       99.336
SET     491.519       99.375
SET     497.663       99.414
SET     503.807       99.453
SET     507.903       99.492
SET     511.999       99.531
SET     518.143       99.570
SET     528.383       99.609
SET     532.479       99.629
SET     536.575       99.648
SET     540.671       99.668
SET     544.767       99.688
SET     552.959       99.707
SET     557.055       99.727
SET     565.247       99.746
SET     569.343       99.766
SET     577.535       99.785
SET     585.727       99.805
SET     589.823       99.814
SET     593.919       99.824
SET     598.015       99.834
SET     602.111       99.844
SET     602.111       99.854
SET     610.303       99.863
SET     614.399       99.873
SET     614.399       99.883
SET     622.591       99.893
SET     626.687       99.902
SET     630.783       99.907
SET     630.783       99.912
SET     634.879       99.917
SET     634.879       99.922
SET     638.975       99.927
SET     643.071       99.932
SET     647.167       99.937
SET     651.263       99.941
SET     651.263       99.946
SET     655.359       99.951
SET     655.359       99.954
SET     659.455       99.956
SET     659.455       99.958
SET     659.455       99.961
SET     663.551       99.963
SET     663.551       99.966
SET     663.551       99.968
SET     667.647       99.971
SET     667.647       99.973
SET     667.647       99.976
SET     667.647       99.977
SET     671.743       99.978
SET     671.743       99.979
SET     675.839       99.980
SET     679.935       99.982
SET     684.031       99.983
SET     688.127       99.984
SET     688.127       99.985
SET     692.223       99.987
SET     696.319       99.988
SET     696.319       99.988
SET     696.319       99.989
SET     696.319       99.990
SET     696.319       99.990
SET     696.319       99.991
SET     700.415       99.991
SET     700.415       99.992
SET     708.607       99.993
SET     708.607       99.993
SET     708.607       99.994
SET     708.607       99.994
SET     708.607       99.995
SET     708.607       99.995
SET     712.703       99.995
SET     712.703       99.995
SET     716.799       99.996
SET     716.799       99.996
SET     720.895       99.996
SET     720.895       99.997
SET     720.895       99.997
SET     720.895       99.997
[...]
SET     720.895       99.998
SET     720.895       99.998
SET     733.183       99.998
SET     733.183       99.998
SET     733.183       99.998
[...]
SET     733.183       99.999
SET     733.183       99.999
SET     733.183       99.999
[...]
SET     745.471       99.999
SET     745.471      100.000
---
GET       5.503        0.000
GET      59.135        5.000
GET      74.239       10.000
GET      78.335       15.000
GET      81.407       20.000
GET      83.455       25.000
GET      86.015       30.000
GET      88.575       35.000
GET      91.135       40.000
GET      93.183       45.000
GET      95.743       50.000
GET      97.279       52.500
GET      98.815       55.000
GET     100.351       57.500
GET     102.399       60.000
GET     104.959       62.500
GET     108.031       65.000
GET     111.103       67.500
GET     115.711       70.000
GET     121.343       72.500
GET     130.559       75.000
GET     136.191       76.250
GET     142.335       77.500
GET     150.527       78.750
GET     160.767       80.000
GET     171.007       81.250
GET     182.271       82.500
GET     193.535       83.750
GET     206.847       85.000
GET     219.135       86.250
GET     233.471       87.500
GET     240.639       88.125
GET     247.807       88.750
GET     254.975       89.375
GET     262.143       90.000
GET     270.335       90.625
GET     278.527       91.250
GET     286.719       91.875
GET     294.911       92.500
GET     305.151       93.125
GET     313.343       93.750
GET     319.487       94.062
GET     325.631       94.375
GET     329.727       94.688
GET     335.871       95.000
GET     342.015       95.312
GET     348.159       95.625
GET     354.303       95.938
GET     360.447       96.250
GET     368.639       96.562
GET     376.831       96.875
GET     380.927       97.031
GET     385.023       97.188
GET     389.119       97.344
GET     393.215       97.500
GET     397.311       97.656
GET     403.455       97.812
GET     409.599       97.969
GET     415.743       98.125
GET     421.887       98.281
GET     428.031       98.438
GET     432.127       98.516
GET     436.223       98.594
GET     440.319       98.672
GET     444.415       98.750
GET     448.511       98.828
GET     452.607       98.906
GET     458.751       98.984
GET     462.847       99.062
GET     468.991       99.141
GET     475.135       99.219
GET     479.231       99.258
GET     483.327       99.297
GET     487.423       99.336
GET     491.519       99.375
GET     497.663       99.414
GET     501.759       99.453
GET     505.855       99.492
GET     509.951       99.531
GET     516.095       99.570
GET     522.239       99.609
GET     528.383       99.629
GET     532.479       99.648
GET     536.575       99.668
GET     540.671       99.688
GET     544.767       99.707
GET     548.863       99.727
GET     552.959       99.746
GET     561.151       99.766
GET     565.247       99.785
GET     569.343       99.805
GET     573.439       99.814
GET     577.535       99.824
GET     581.631       99.834
GET     585.727       99.844
GET     589.823       99.854
GET     593.919       99.863
GET     598.015       99.873
GET     606.207       99.883
GET     614.399       99.893
GET     618.495       99.902
GET     622.591       99.907
GET     626.687       99.912
GET     630.783       99.917
GET     630.783       99.922
GET     634.879       99.927
GET     638.975       99.932
GET     643.071       99.937
GET     647.167       99.941
GET     647.167       99.946
GET     651.263       99.951
GET     655.359       99.954
GET     655.359       99.956
GET     659.455       99.958
GET     663.551       99.961
GET     663.551       99.963
GET     667.647       99.966
GET     667.647       99.968
GET     671.743       99.971
GET     671.743       99.973
GET     675.839       99.976
GET     679.935       99.977
GET     684.031       99.978
GET     684.031       99.979
GET     688.127       99.980
GET     692.223       99.982
GET     692.223       99.983
GET     696.319       99.984
GET     696.319       99.985
GET     700.415       99.987
GET     700.415       99.988
GET     704.511       99.988
GET     704.511       99.989
GET     704.511       99.990
GET     708.607       99.990
GET     708.607       99.991
GET     708.607       99.991
GET     712.703       99.992
GET     712.703       99.993
GET     712.703       99.993
GET     716.799       99.994
GET     716.799       99.994
GET     716.799       99.995
GET     720.895       99.995
GET     720.895       99.995
GET     720.895       99.995
GET     720.895       99.996
GET     724.991       99.996
GET     724.991       99.996
GET     724.991       99.997
GET     724.991       99.997
GET     729.087       99.997
GET     729.087       99.997
GET     729.087       99.997
GET     733.183       99.998
GET     733.183       99.998
GET     737.279       99.998
GET     737.279       99.998
GET     741.375       99.998
GET     745.471       99.998
GET     745.471       99.998
GET     745.471       99.999
GET     745.471       99.999
GET     745.471       99.999
[...]
GET     749.567       99.999
GET     749.567       99.999
GET     749.567       99.999
[...]
GET     749.567      100.000
GET     749.567      100.000
GET     749.567      100.000
[...]
GET     827.391      100.000
GET     827.391      100.000
GET     827.391      100.000
[...]
GET     831.487      100.000
GET     831.487      100.000
---
WAIT      0.000      100.000